
INSERT INTO `parts` (`part`, `relation_familiale`, `cond`)
 VALUES ('1/2', 'زوج', 'يرث الزوج من زوجته النصف إن لم يكن لها فرع وارث سواء كان منه أو من غيره، والفرع الوارث هم: 
 ((الأولاد بنون أو بنات، وأولاد الأبناء وإن نزلوا)) أما أولاد البنات فهم فروع غير وارثين. قال الله تعالى:
  (وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِنْ لَمْ يَكُنْ لَهُنَّ وَلَدٌ فَإِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمْ ا
 لرُّبُعُ مِمَّا تَرَكْنَ مِنْ بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ ..) .')

INSERT INTO `parts` (`part`, `relation_familiale`, `cond`) VALUES ('1/4','زوج','يرث الزوج من زوجته الربع إن كان لها فرع وارث سواء كان منه أو من غيره، والفرع الوارث هم: ((الأولاد بنون أو بنات، وأولاد الأبناء وإن نزلوا)) أما أولاد البنات فهم فروع غير وارثين. قال الله تعالى: (وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِنْ لَمْ يَكُنْ لَهُنَّ وَلَدٌ فَإِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمْ الرُّبُعُ مِمَّا تَرَكْنَ مِنْ بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ ..) .'),
 ('1/4', 'زوجـة','ترث الزوجة من زوجها الربع إن لم يكن له فرع وارث سواء كان منها أو من غيرها، والفرع الوارث هم: ((الأولاد بنون أو بنات، وأولاد الأبناء وإن نزلوا)) أما أولاد البنات فهم فروع غير وارثين. قال الله تعالى: (وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِنْ لَمْ يَكُنْ لَكُمْ وَلَدٌ فَإِنْ كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُمْ مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ ..) .');

INSERT INTO `parts` (`part`, `relation_familiale`, `cond`) VALUES ('1/8', 'زوجـة','ترث الزوجة من زوجها الثمن إن كان له فرع وارث سواء كان منها أو من غيرها، والفرع الوارث هم: ((الأولاد بنون أو بنات، وأولاد الأبناء وإن نزلوا)) أما أولاد البنات فهم فروع غير وارثين. قال الله تعالى: (وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِنْ لَمْ يَكُنْ لَكُمْ وَلَدٌ فَإِنْ كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُمْ مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ ..) .'),
 ('1/3', 'أم','ترث الأم الثلث بثلاثة شروط: عدم الفرع الوارث مذكرا كان أو مؤنثا، عدم وجود اكثر من أخ و ألا تكون المسألة إحدى العمريتين وهى إجتماع الأم مع الأب مع أحد الزوجين. قال الله تعالى: (...وَلأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ فَإِنْ لَمْ يَكُنْ لَهُ وَلَدٌ وَوَرِثَهُ أَبَوَاهُ فَلأُمِّهِ الثُّلُثُ فَإِنْ كَانَ لَهُ إِخْوَةٌ فَلأُمِّهِ السُّدُسُ مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِهَا أَوْ دَيْنٍ ..)');

INSERT INTO `parts` (`part`, `relation_familiale`, `cond`) VALUES ('1/6', 'أم', 'ترث الأم السدس عند وجود الفرع الوارث مذكرا كان أو مؤنثا، أو عند وجود اكثر من أخ. قال الله تعالى: (...وَلأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ فَإِنْ لَمْ يَكُنْ لَهُ وَلَدٌ وَوَرِثَهُ أَبَوَاهُ فَلأُمِّهِ الثُّلُثُ فَإِنْ كَانَ لَهُ إِخْوَةٌ فَلأُمِّهِ السُّدُسُ مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِهَا أَوْ دَيْنٍ ..)'),
 ('عاصب', 'أب', 'عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد الأب بالتركة، سيكون له احق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم الأب، سيكتفي بالحصول على باقي التركة لأنه أولى رجل ذكر .قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'), 
 ('1/6 + إضافة الى باقى التركة (ان تبقى شيء)', 'أب', 'يرث الأب سدس التركة فى حالة وجود الفرع الوارث المؤنث (مثل البنت وبنت الإبن وبنت إبن الإبن) لقوله تعالى (وَلأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ) .إضافة الى الباقى من التركة (إن تبقى شىء) تعصيبا لأنه أولى رجل ذكر لقولة صلى الله عليه وسلم (ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'),
  ('1/6', 'أب', 'يرث الأب السدس فقط فى حالة وجود الفرع الوارث المذكر (مثل الإبن وإبن الإبن ).قال تعالى (وَلأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ)'),
 
 ('1/6', 'أم الأم', 'فرض الجدة الصحيحة هو السدس .وتشتركن فيه الجدات الصحيحات المتحدات فى الدرجة '),
 ('1/12', 'أم الأم', 'تتشارك ام الام مع ام الاب في السدس بالتسوية'),
 
  ('1/6', 'أم الأب', 'فرض الجدة الصحيحة هو السدس .وتشتركن فيه الجدات الصحيحات المتحدات فى الدرجة'),
  ('1/12', 'أم الأب', 'تتشارك ام الاب مع ام الام في السدس بالتسوية'),
 
  
   ('عاصب', 'أب الأب', 'عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد اب الأب بالتركة، سيكون له احق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم اب الأب، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'),
   ('1/6 + إضافة الى باقى التركة (ان تبقى شيء)', 'أب الأب', 'الجد الصحيح مثله مثل الأب عند عدمه إلا فى المسألتين العمريتين أو وقوعه مع إخوة لغير أم عند الجمهور . فيرث سدس التركة فى حالة وجود الفرع الوارث المؤنث (مثل البنت وبنت الإبن وبنت إبن الإبن) لقوله تعالى (وَلأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ) .إضافة الى الباقى من التركة (إن تبقى شىء) تعصيبا لأنه أولى رجل ذكر لقولة صلى الله عليه وسلم (ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'),
   ('1/6', 'أب الأب', 'الجد الصحيح مثله مثل الأب عند عدمه إلا فى المسألتين العمريتين أو وقوعه مع إخوة لغير أم عند الجمهور . فيرث السدس فقط فى حالة وجود الفرع الوارث المذكر (مثل الإبن وإبن الإبن ).قال تعالى (وَلأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ)'),
   
  
    ('عاصب', 'ابن', 'عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد الابن بالتركة، سيكون له احق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم الابن، سيكتفي بالحصول على باقي التركة لأنه أولى رجل ذكر .قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر) '),
    ('للذكر مثل حظ الأنثيين', 'ابن', '(يرث الأبناء الذكور والإناث معا تعصيبا للذكر مثل حظ الأنثيين لقوله تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ'),
  
    ('للذكر مثل حظ الأنثيين','بنت', '(يرث الأبناء الذكور والإناث معا تعصيبا للذكر مثل حظ الأنثيين لقوله تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ'),
    ('1/2', 'بنت', 'ترث البنت الواحدة النصف إذا لم يكن لها أخ يعصبها. لقوله تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ فَإِنْ كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ وَإِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ)'), 
    ('2/3', 'بنت', 'ترث البنتين فأكثر الثلثين إذا لم يكن لهن أخ يعصبهن. لقوله تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ فَإِنْ كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ وَإِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ) ولأنه صلى الله عليه وسلم أعطى الثلثين لبنتى سعد بن الربيع'),
    
    ('عاصب','ابن ابن', ' عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد ابن الابن بالتركة، سيكون له احق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم ابن الابن، سيكتفي بالحصول على باقي التركة لأنه أولى رجل ذكر .قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'),
    ('للذكر مثل حظ الأنثيين','ابن ابن', 'يرث أبناء الأبناء الذكور والإناث معا تعصيبا للذكر مثل حظ الأنثيين لقوله تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ))'),
    

     ('للذكر مثل حظ الأنثيين','بنت ابن', 'يرث أبناء الأبناء الذكور والإناث معا تعصيبا للذكر مثل حظ الأنثيين لقوله تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ))'),
     
     ('1/2', 'بنت ابن', 'بنات الإبن - مثل بنت الإبن وبنت ابن الإبن - مثلهن مثل البنت بشرط عدم وجود بنت صلبيه أوابن صلبى أو ابن ابن اعلى منهن فيحجبهن. فترث الواحدة من بنات الإبن النصف إذا لم يكن هناك ابن ابن فى درجتها يعصبها وترث الأكثر من واحدة الثلثين . قال تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ فَإِنْ كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ وَإِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ)'),
     ('2/3', 'بنت ابن', 'نات الإبن - مثل بنت الإبن وبنت ابن الإبن - مثلهن مثل البنت بشرط عدم وجود بنت صلبيه أوابن صلبى أو ابن ابن اعلى منهن فيحجبهن. فترث الواحدة من بنات الإبن النصف إذا لم يكن هناك ابن ابن فى درجتها يعصبها وترث الأكثر من واحدة الثلثين . قال تعالى (يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ فَإِنْ كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ وَإِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ)'),
     ('1/6', 'بنت ابن', 'بنت الإبن مع البنت الصلبيه الواحده فى عدم الإبن الصلبى وابن الإبن الذى فى درجتها - يعصبها - وابن الإبن الأعلى منها درجة - يحجبها - ترث السدس تكملة للثلثين تنفرد به الواحده وتشترك فيه الأكثر من واحده لقول ابن مسعود - رضى الله عنه - فى مسألة بنت وبنت ابن وأخت شقيقة (أقضى فيها بقضاء رسول الله للبنت النصف،ولبنت الإبن السدس تكملة للثلثين ،وللأخت الشقية الباقى )');

INSERT INTO `parts` (`part`, `relation_familiale`, `cond`) VALUES ('1/3', 'أخ لأم', 'فرض الأكثر من واحد من الأخوة لأم هو الثلث ويقسم الثلث بينهم بالسوية لافرق بين ذكر وأنثى ، وشرط ميراثهم هو عدم وجود الفرع الوارث المذكر - مثل الإبن وابن الإبن - أو المؤنث - مثل البنت وبنت الإبن - وعدم وجود الأصل الوارث المذكر - مثل الأب و أب الأب'), 
('1/3', 'أخت لأم', 'فرض الأكثر من واحدة من الأخوات لأم هو الثلث ويقسم الثلث بينهم بالسوية لافرق بين ذكر وأنثى ، وشرط ميراثهم هو عدم وجود الفرع الوارث المذكر - مثل الإبن وابن الإبن - أو المؤنث - مثل البنت وبنت الإبن - وعدم وجود الأصل الوارث المذكر - مثل الأب و أب الأب'),

 ('1/3', 'اخوة لأم', 'فرض الأكثر من واحد من الأخوة لأم هو الثلث سواء أكانوا ذكورا أو إناثا ويقسم الثلث بينهم بالسوية لافرق بين ذكر وأنثى ، وشرط ميراثهم هو عدم وجود الفرع الوارث المذكر - مثل الإبن وابن الإبن - أو المؤنث - مثل البنت وبنت الإبن - وعدم وجود الأصل الوارث المذكر - مثل الأب و أب الأب'),
 ('1/6', 'أخت لأم', 'فرض الواحد - المنفردة - من الأخوة لأم هو السدس سواء أكان ذكرا أو أنثى ، وشرط ميراثهم هو عدم وجود الفرع الوارث المذكر - مثل الإبن وابن الإبن - أو المؤنث - مثل البنت وبنت الإبن - وعدم وجود الأصل الوارث المذكر - مثل الأب و أب الأب'),
 ('1/6', 'أخ لأم ', 'فرض الواحد - المنفرد - من الأخوة لأم هو السدس سواء أكان ذكرا أو أنثى ، وشرط ميراثهم هو عدم وجود الفرع الوارث المذكر - مثل الإبن وابن الإبن - أو المؤنث - مثل البنت وبنت الإبن - وعدم وجود الأصل الوارث المذكر - مثل الأب و أب الأب');
 


INSERT INTO `parts` (`part`, `relation_familiale`, `cond`) VALUES ('1/2', 'أخت شقيقة', 'الأخت الشقيقة - عند عدم الأخ الشقيق - مثلها مثل البنت - اذا لم يكن هناك بنات صلبيات أو بنات ابن - فتأخذ الشقيقة النصف نظرًا لأنها واحده.قال تعالى ( يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ وَهُوَ يَرِثُهَا إِن لَّمْ يَكُن لَّهَا وَلَدٌ فَإِن كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثَانِ) ويشترط لذلك أن تكون المسألة كلالة أى لا يكون هناك ولد مثل الإبن الصلبى وابن الإبن وإن نزل - ولا والد- وإلا حجبت بهم'),

  ('عاصب','أخ شقيق', 'عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد الاخ الشقيق بالتركة، سيكون له حق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم الاخ الشقيق، سيكتفي بالحصول على باقي التركة لأنه أولى رجل ذكر .قال صلى الله عليه وسلم (ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'), 
 
  ('2/3','أخت شقيقة', 'الاخوات الشقيقات - عند عدم الأخ الشقيق - مثلها مثل البنت - اذا لم يكن هناك بنات صلبيات أو بنات ابن - فتأخذن الثلثان .قال تعالى ( يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ وَهُوَ يَرِثُهَا إِن لَّمْ يَكُن لَّهَا وَلَدٌ فَإِن كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثَانِ) ويشترط لذلك أن تكون المسألة كلالة أى لا يكون هناك ولد مثل الإبن الصلبى وابن الإبن وإن نزل - ولا أب -ولا أب الأب وإلا حجبت بهم'), 
 ('عاصبة', 'أخت شقيقة', 'الأخت الشقيقة - عند عدم الأخ الشقيق - وفى وجود البنات - مثل البنت الصلبيه و بنت الإبن - تصير عصبة - مع الغير - فترث الباقى تعصيبا لقول بن مسعود - رضى الله عنه - فى مسألة بنت وبنت ابن واخت شقيقة (أقضى فيها بقضاء رسول الله للبنت النصف،ولبنت الإبن السدس تكملة للثلثين ،وللأخت الشقية الباقى ) ، ويشترط لميراثها أن تكون المسألة كلاله أى لا يكون هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل - ولا أب -ولا أب الأب وإلا حجبت بهم'),
 ('للذكر مثل حظ الأنثيين', 'أخت شقيقة', 'الأخوة الأشقاء رجالا ونساء يرثون معا بالتعصيب للذكر مثل حظ الأنثيين .قال تعالى ( وَإِن كَانُواْ إِخْوَةً رِّجَالاً وَنِسَاء فَلِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ) ، ويشترط لذلك أن تكون المسألة كلالة أى لا يكون هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل - ولا أب -ولا أب الأب وإلا حجبوا بهم'),

('للذكر مثل حظ الأنثيين','أخ شقيق', 'الأخوة الأشقاء رجالا ونساء يرثون معا بالتعصيب للذكر مثل حظ الأنثيين .قال تعالى ( وَإِن كَانُواْ إِخْوَةً رِّجَالاً وَنِسَاء فَلِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ) ، ويشترط لذلك أن تكون المسألة كلالة أى لا يكون هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل - ولا أب -ولا أب الأب وإلا حجبوا بهم');



 
INSERT INTO `parts` (`part`, `relation_familiale`, `cond`) VALUES ('عاصب', 'أخ لاب', 'عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد أخ لاب بالتركة، سيكون له الحق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم أخ لاب، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'),
('2/3', 'أخت لأب', 'الأخوات لأب ترث الواحدة منهن النصف ، وترث الأكثر من واحدة الثلثين وهذا بثلاثة شروط ، الاول أن تكون المسألة كلاله أى ليس هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل - أو والد - وإلا حجبن بهم، والثانى عدم البنت وبنت الإبن وان نزلت ،والثالث عدم الإخوه والأخوات الأشقاء .قال تعالى ( يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ وَهُوَ يَرِثُهَا إِن لَّمْ يَكُن لَّهَا وَلَدٌ فَإِن كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثَانِ)'),
 ('عاصبة', 'أخت لأب', 'الأخت لأب مثلها مثل الشقيقة ، فعند عدم الأخ لأب و الإخوة الأشقاء رجالا ونساء وفى وجود البنات - مثل البنت الصلبيه و بنت الإبن - تصير عصبة - مع الغير - فترث الباقى تعصيبا لقول بن مسعود - رضى الله عنه - فى مسألة بنت وبنت ابن واخت شقيقة (أقضى فيها بقضاء رسول الله للبنت النصف،ولبنت الإبن السدس تكملة للثلثين ،وللأخت الشقية الباقى ) ، ويشترط لميراثها أن تكون المسألة كلاله أى لا يكون هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل -ولا أب -ولا أب الأب وإلا حجبت بهم'),
 ('1/2', 'أخت لأب', 'الأخوات لأب ترث الواحدة منهن النصف ، وترث الأكثر من واحدة الثلثين وهذا بثلاثة شروط ، الاول أن تكون المسألة كلاله أى ليس هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل والأب -ولا أب الأب - وإلا حجبن بهم، والثانى عدم البنت وبنت الإبن وان نزلت ،والثالث عدم الإخوه والأخوات الأشقاء .قال تعالى ( يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ وَهُوَ يَرِثُهَا إِن لَّمْ يَكُن لَّهَا وَلَدٌ فَإِن كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثَانِ)'),
('للذكر مثل حظ الأنثيين','أخت لأب', 'الأخوة لأب رجالا ونساء يرثون معا بالتعصيب للذكر مثل حظ الأنثيين .قال تعالى ( وَإِن كَانُواْ إِخْوَةً رِّجَالاً وَنِسَاء فَلِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ) ، ويشترط لذلك أن تكون المسألة كلالة أى لا يكون هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل وإلا حجبوا بهم ،وألا يكون هناك اب و اب الاب ،وألا يكون هناك إخوة اشقاء ذكور ، وألا تجتمع الشقيقة مع البنت أو بنت الإبن'),
('للذكر مثل حظ الأنثيين','أخ لاب', 'الأخوة لأب رجالا ونساء يرثون معا بالتعصيب للذكر مثل حظ الأنثيين .قال تعالى ( وَإِن كَانُواْ إِخْوَةً رِّجَالاً وَنِسَاء فَلِلذَّكَرِ مِثْلُ حَظِّ الأُنثَيَيْنِ) ، ويشترط لذلك أن تكون المسألة كلالة أى لا يكون هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل وإلا حجبوا بهم ،وألا يكون هناك اب و اب الاب ،وألا يكون هناك إخوة اشقاء ذكور ، وألا تجتمع الشقيقة مع البنت أو بنت الإبن'),
('1/6', 'أخت لأب', 'الأخت لأب - عند عدم الأخ لأب - مع الشقيقة مثلها مثل بنت الإبن مع البنت فترث السدس تكملة للثلثين ان كان هناك شقيقة واحدة ولا ترث شيئا إذا كان هناك أكثر من شقيقة ، ويشترط لذلك أن تكون المسألة كلاله أى ليس هناك ولد - مثل الإبن الصلبى وابن الإبن وإن نزل - أوأب وأب الأب - وإلا حجبت بهم ، وألا يكون هناك فرع وارث مؤنث مع الشقيقة لأن الشقيقة ستصير عصبة معهم -عصبة مع الغير ، وألا يكون هناك إخوة أشقاء ذكور');





INSERT INTO `parts` (`part`, `relation_familiale`, `cond`) VALUES ('عاصب','ابن أخ شقيق','عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد ابن الأخ الشقيق بالتركة، سيكون له حق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم ابن الأخ الشقيق، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر)'),
 ('عاصب', 'ابن أخ لأب','عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد ابن الأخ لأب بالتركة، سيكون له حق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم ابن الأخ لأب، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر).'), 
 ('عاصب','عم شقيق','عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد العم الشقيق بالتركة، سيكون له حق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم  العم الشقيق، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر).'),
('عاصب','عم لأب','عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد العم لاب  بالتركة، سيكون له حق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم العم لاب، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر).'),
('عاصب', 'ابن عم شقيق','عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد ابن العم الشقيق بالتركة، سيكون له حق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم  ابن العم الشقيق، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر).'),
('عاصب', 'ابن عم لأب','عاصب من التعصيب وهوالإرث بلا تقدير محدد نصيب ، في حالة تفرد ابن العم لاب  بالتركة، سيكون له حق الحصول على جميع الممتلكات الموروثة. وفي حالة وجود ورثة آخرين لا يمنعهم  ابن العم لاب، سيكتفي بالحصول على باقي التركة..قال صلى الله عليه وسلم ( ألحقوا الفرائض بأهلها فما بقى فهو لأولى رجل ذكر).');




